In [2]:
import pandas as pd

C:\Users\USUARIO\AppData\Local\Temp\ipykernel_8384\4080736814.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

In [3]:
# Leer el archivo CSV original
candidates_df = pd.read_csv("C:/Users/USUARIO/Desktop/5to Semestre/ETL/candidates.csv", delimiter=';')

# Reemplazar espacios en los nombres de las columnas
candidates_df.columns = candidates_df.columns.str.replace(' ', '')

# Escribir el DataFrame modificado a un nuevo archivo CSV con el delimitador deseado (por ejemplo, coma)
candidates_df.to_csv("C:/Users/USUARIO/Desktop/5to Semestre/ETL/candidates_modified.csv", index=False)

In [8]:
candidates_df.head()

,FirstName,LastName,Email,ApplicationDate,Country,YOE,Seniority,Technology,CodeChallengeScore,TechnicalInterviewScore
0,Bernadette,Langworth,leonard91@yahoo.com,2021-02-26,Norway,2,Intern,Data Engineer,3,3
1,Camryn,Reynolds,zelda56@hotmail.com,2021-09-09,Panama,10,Intern,Data Engineer,2,10
2,Larue,Spinka,okey_schultz41@gmail.com,2020-04-14,Belarus,4,Mid-Level,Client Success,10,9
3,Arch,Spinka,elvera_kulas@yahoo.com,2020-10-01,Eritrea,25,Trainee,QA Manual,7,1
4,Larue,Altenwerth,minnie.gislason@gmail.com,2020-05-20,Myanmar,13,Mid-Level,Social Media Community Management,9,7

In [9]:
candidates_df.shape

(50000, 10)

In [11]:
candidates_df.dtypes.value_counts()

object    7
int64     3
Name: count, dtype: int64

In [10]:
candidates_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 10 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   FirstName                50000 non-null  object
 1   LastName                 50000 non-null  object
 2   Email                    50000 non-null  object
 3   ApplicationDate          50000 non-null  object
 4   Country                  50000 non-null  object
 5   YOE                      50000 non-null  int64
 6   Seniority                50000 non-null  object
 7   Technology               50000 non-null  object
 8   CodeChallengeScore       50000 non-null  int64
 9   TechnicalInterviewScore  50000 non-null  int64
dtypes: int64(3), object(7)
memory usage: 3.8+ MB

In [12]:
candidates_df.isnull().any()

FirstName                  False
LastName                   False
Email                      False
ApplicationDate            False
Country                    False
YOE                        False
Seniority                  False
Technology                 False
CodeChallengeScore         False
TechnicalInterviewScore    False
dtype: bool

In [13]:
candidates_df[['YOE','CodeChallengeScore','TechnicalInterviewScore']].describe()

                YOE  CodeChallengeScore  TechnicalInterviewScore
count  50000.000000        50000.000000             50000.000000
mean      15.286980            4.996400                 5.003880
std        8.830652            3.166896                 3.165082
min        0.000000            0.000000                 0.000000
25%        8.000000            2.000000                 2.000000
50%       15.000000            5.000000                 5.000000
75%       23.000000            8.000000                 8.000000
max       30.000000           10.000000                10.000000

In [14]:
candidates_df.describe(include='object')

,FirstName,LastName,Email,ApplicationDate,Country,Seniority,Technology
count,50000,50000,50000,50000,50000,50000,50000
unique,3007,474,49833,1646,244,7,24
top,Sarai,Murazik,fern70@gmail.com,2020-07-07,Malawi,Intern,Game Development
freq,33,138,3,50,242,7255,3818